import React from 'react';

/**
 * Year component
 *
 * @param {Object} props
 */

export default function Week(props) {

    let {visibleMonths} = props;

    return (
        <div className="year-inner-component">
            <ul>

            </ul>
        </div>
    );
}

/**
 * todo
 * берешь предыдущий месяц, если это январь, то берешь с предыдущего года. высчитываешь с какого дня недели начинался этот месяц.
 * начинаешь строить от 0..7 строчки, начиная с цифры, которая соотвествует дню, в который этот месяц начинался. Например
 * 7 октября 2019 начинается в пн - значит строим с  цифры 1 (потому что  нумерация с 0 а у америксов 0 - воскресенье). строим 3 месяца
 */